GHB2/src/InformationRegisters/гхб_НастройкиВозможностейДобавленияКризисМенеджеров/гхб_НастройкиВозможностейДобавленияКризисМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_НастройкиВозможностейДобавленияКризисМенеджеров</name>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_НастройкиВозможностейДобавленияКризисМенеджеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДоступныеЛокацииДляСотрудника(_Сотрудник) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_НастройкиВозможностейДобавленияКризисМенеджеров.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_НастройкиВозможностейДобавленияКризисМенеджеров КАК гхб_НастройкиВозможностейДобавленияКризисМенеджеров
	               |ГДЕ
	               |	гхб_НастройкиВозможностейДобавленияКризисМенеджеров.Сотрудник = &Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гхб_НастройкиВозможностейДобавленияКризисМенеджеров.Локация";
	
	Запрос.УстановитьПараметр("Сотрудник", _Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
